Revit 2027 API
ViewSheetSetting.CurrentViewSheetSet Property
The current view sheet set of PrintSetup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IViewSheetSet CurrentViewSheetSet { get; set; }
Public Property CurrentViewSheetSet As IViewSheetSet
	Get
	Set
public:
property IViewSheetSet^ CurrentViewSheetSet {
	IViewSheetSet^ get ();
	void set (IViewSheetSet^ value);
}
member CurrentViewSheetSet : IViewSheetSet with get, set
Property Value
IViewSheetSet
See Also
Reference
ViewSheetSetting Class
Autodesk.Revit.DB Namespace